# %%
import numpy as np
import pandas as pd
df = pd.read_csv('df_Status_HI_Group_noTBS.csv')
df['AOI不良分流-4'] += df['AOI不良分流-7']
df['ICT不良分流-2-4'] += df['ICT不良分流-2-7']
df['ICT不良分流-1-4'] += df['ICT不良分流-1-7']
df.drop(columns=['AOI不良分流-7', 'ICT不良分流-1-7', 'ICT不良分流-2-7', 
                 'Begin_Hour', 'LINE_NAME', 'MODEL_NAME', 'Date', 'MO_NUMBER', 'REAL_QTY_Equv'], inplace=True)

df['AOI不良分流-3'] = 0

df['ICT不良分流-1-2'] = 0
df['ICT不良分流-1-3'] = 0

df['ICT不良分流-2-2'] = 0
df['ICT不良分流-2-3'] = 0

df['UV爐-2'] = 0

df['二次線體-1'] = 0
df['二次線體-2'] = 0
df['二次線體-3'] = 0
df['二次線體-4'] = 0

df['推板機-1'] = 0
df['推板機-2'] = 0
df['推板機-3'] = 0
df['推板機-4'] = 0

df['自動Link-2'] = 0

df['追蹤點膠機-3'] = 0

df['靜態不良分流-2'] = 0
df['靜態不良分流-3'] = 0
df['靜態不良分流-4'] = 0
# %%
df = df[['AOI--1', 'AOI-0', 'AOI-1', 'AOI-2', 'AOI-3', 'AOI-4',
       'AOI不良分流--1', 'AOI不良分流-0', 'AOI不良分流-1', 'AOI不良分流-2', 'AOI不良分流-3',
       'AOI不良分流-4', 'ICT不良分流-1--1', 'ICT不良分流-1-0', 'ICT不良分流-1-1',
       'ICT不良分流-1-2', 'ICT不良分流-1-3', 'ICT不良分流-1-4', 'ICT不良分流-2--1',
       'ICT不良分流-2-0', 'ICT不良分流-2-1', 'ICT不良分流-2-2', 'ICT不良分流-2-3',
       'ICT不良分流-2-4', 'UV爐--1', 'UV爐-0', 'UV爐-1', 'UV爐-2', 'UV爐-3',
       'UV爐-4', '二次線體--1', '二次線體-0', '二次線體-1', '二次線體-2', '二次線體-3',
       '二次線體-4', '分板機-1--1', '分板機-1-0', '分板機-1-1', '分板機-1-2', '分板機-1-3',
       '分板機-1-4', '噴膠機(五軸)--1', '噴膠機(五軸)-0', '噴膠機(五軸)-1', '噴膠機(五軸)-2',
       '噴膠機(五軸)-3', '噴膠機(五軸)-4', '推板機--1', '推板機-0', '推板機-1', '推板機-2',
       '推板機-3', '推板機-4', '泡膠機--1', '泡膠機-0', '泡膠機-1', '泡膠機-2', '泡膠機-3',
       '泡膠機-4', '翻板移載機--1', '翻板移載機-0', '翻板移載機-1', '翻板移載機-2', '翻板移載機-3',
       '翻板移載機-4', '自動ICT-1--1', '自動ICT-1-0', '自動ICT-1-1', '自動ICT-1-2',
       '自動ICT-1-3', '自動ICT-1-4', '自動ICT-2--1', '自動ICT-2-0', '自動ICT-2-1',
       '自動ICT-2-2', '自動ICT-2-3', '自動ICT-2-4', '自動Link--1', '自動Link-0',
       '自動Link-1', '自動Link-2', '自動Link-3', '自動Link-4', '追蹤點膠機--1',
       '追蹤點膠機-0', '追蹤點膠機-1', '追蹤點膠機-2', '追蹤點膠機-3', '追蹤點膠機-4', '靜態不良分流--1',
       '靜態不良分流-0', '靜態不良分流-1', '靜態不良分流-2', '靜態不良分流-3', '靜態不良分流-4',
       '靜態測試--1', '靜態測試-0', '靜態測試-1', '靜態測試-2', '靜態測試-3', '靜態測試-4', 'UPH',
       'UPH_Equv', 'PLAN_QTY_Equv', 'WORK_TIME', 'LINE_RATE', 'Hour_Duration', 'Weekday', 'Hour', 'Holiday']]
# %%
df.to_csv('uph_opt.csv', index=False, encoding='gbk')
# %%
